pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_bootloader_syntax.cpp
//---------------------------------------------------------------------------*
//                                                                           *
//                    File 'pic18_bootloader_syntax.cpp'                     *
//             Generated by version version GALGAS_BETA_VERSION              *
//                    november 13th, 2010, at 23h25'41"                      *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#include "version_libpm.h"
#if CURRENT_LIBPM_VERSION != VERSION_OF_LIBPM_USED_BY_GALGAS_COMPILER
  #error "This file has been compiled with a version of GALGAS that uses libpm version VERSION_OF_LIBPM_USED_BY_GALGAS_COMPILER, different than the current version (CURRENT_LIBPM_VERSION) of libpm"
#endif

//---------------------------------------------------------------------------*

#include "pic18_bootloader_syntax.h"
#include "galgas2/C_galgas_CLI_Options.h"

//---------------------------------------------------------------------------*

#include "piccoloDevice_grammar.h"
#include "piccolo_options.h"
#include "piccolo_grammar.h"

//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  #define SOURCE_FILE_AT_LINE(line) "pic18_bootloader_syntax.gSyntax", line
  #define COMMA_SOURCE_FILE_AT_LINE(line) , SOURCE_FILE_AT_LINE(line)
#else
  #define SOURCE_FILE_AT_LINE(line) 
  #define COMMA_SOURCE_FILE_AT_LINE(line) 
#endif

void cParser_pic_31__38__5F_bootloader_5F_syntax::rule_pic_31__38__5F_bootloader_5F_syntax_parse_5F_bootloader_i0_ (GALGAS_lstring & outArgument_outBootloaderName,
                                                                                                                    GALGAS_lstring & outArgument_outDeviceName,
                                                                                                                    GALGAS_routineDeclarationList & outArgument_outBootloaderRoutineDeclarationList,
                                                                                                                    GALGAS_bootloaderReservedRAMmap & outArgument_outBootloaderReservedRAMmap,
                                                                                                                    GALGAS_luint & outArgument_outReservedRomSize,
                                                                                                                    GALGAS_routineDeclarationList & outArgument_outUserRoutineDeclarationList,
                                                                                                                    GALGAS_ramDefinitionList & outArgument_outSharedRamDefinitionList,
                                                                                                                    GALGAS_string & outArgument_outListFileContents,
                                                                                                                    GALGAS_piccoloDeviceModel & outArgument_outPiccoloDeviceModel,
                                                                                                                    GALGAS_uint & outArgument_outAccessBankSplitOffset,
                                                                                                                    GALGAS_ramBankTable & outArgument_outRamBank,
                                                                                                                    GALGAS_registerTable & outArgument_outRegisterTable,
                                                                                                                    C_Lexique_piccolo_5F_lexique * inCompiler) {
  outArgument_outBootloaderName.drop () ; // Release 'out' argument
  outArgument_outDeviceName.drop () ; // Release 'out' argument
  outArgument_outBootloaderRoutineDeclarationList.drop () ; // Release 'out' argument
  outArgument_outBootloaderReservedRAMmap.drop () ; // Release 'out' argument
  outArgument_outReservedRomSize.drop () ; // Release 'out' argument
  outArgument_outUserRoutineDeclarationList.drop () ; // Release 'out' argument
  outArgument_outSharedRamDefinitionList.drop () ; // Release 'out' argument
  outArgument_outListFileContents.drop () ; // Release 'out' argument
  outArgument_outPiccoloDeviceModel.drop () ; // Release 'out' argument
  outArgument_outAccessBankSplitOffset.drop () ; // Release 'out' argument
  outArgument_outRamBank.drop () ; // Release 'out' argument
  outArgument_outRegisterTable.drop () ; // Release 'out' argument
  //-------- @terminalCheckInstructionForGeneration
  inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_pic_31__38_) COMMA_SOURCE_FILE_AT_LINE (64)) ;
  //-------- @terminalCheckInstructionForGeneration
  inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_bootloader) COMMA_SOURCE_FILE_AT_LINE (65)) ;
  //-------- @terminalCheckInstructionForGeneration
  outArgument_outBootloaderName = inCompiler->synthetizedAttribute_tokenString () ;
  inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_identifier) COMMA_SOURCE_FILE_AT_LINE (66)) ;
  //-------- @terminalCheckInstructionForGeneration
  outArgument_outDeviceName = inCompiler->synthetizedAttribute_tokenString () ;
  inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_literal_5F_string) COMMA_SOURCE_FILE_AT_LINE (67)) ;
  //-------- @terminalCheckInstructionForGeneration
  inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken__7B_) COMMA_SOURCE_FILE_AT_LINE (69)) ;
  //-------- @assignmentInstructionForGeneration
  outArgument_outBootloaderRoutineDeclarationList = GALGAS_routineDeclarationList::constructor_emptyList (SOURCE_FILE_AT_LINE (70)) ;
  //-------- @assignmentInstructionForGeneration
  outArgument_outBootloaderReservedRAMmap = GALGAS_bootloaderReservedRAMmap::constructor_emptyMap (SOURCE_FILE_AT_LINE (71)) ;
  //-------- @assignmentInstructionForGeneration
  outArgument_outReservedRomSize = GALGAS_luint::constructor_new (GALGAS_uint ((PMUInt32) 0U), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (72)) ;
  //-------- @repeatInstructionForGeneration
  bool repeatFlag_0 = true ;
  while (repeatFlag_0) {
    switch (select_pic_31__38__5F_bootloader_5F_syntax_0 (inCompiler)) {
    case 2: {
      //-------- @nonterminalInstructionForGeneration
      nt_routine_5F_declaration_ (outArgument_outBootloaderRoutineDeclarationList, inCompiler) ;
    } break ;
    case 3: {
      //-------- @terminalCheckInstructionForGeneration
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_rom) COMMA_SOURCE_FILE_AT_LINE (77)) ;
      //-------- @terminalCheckInstructionForGeneration
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken__3D_) COMMA_SOURCE_FILE_AT_LINE (78)) ;
      //-------- @terminalCheckInstructionForGeneration
      GALGAS_luint var_rs = inCompiler->synthetizedAttribute_uint_33__32_value () ;
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_integer) COMMA_SOURCE_FILE_AT_LINE (79)) ;
      //-------- @ifInstructionForGeneration
      if (GALGAS_bool (kIsNotEqual, outArgument_outReservedRomSize.reader_uint (SOURCE_FILE_AT_LINE (80)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).isValidAndTrue ()) {
        //-------- @errorInstructionForGeneration
        GALGAS_location location_1 (var_rs.reader_location (HERE)) ; // Implicit use of 'location' reader
        inCompiler->emitSemanticError (location_1, GALGAS_string ("ROM size already defined") COMMA_SOURCE_FILE_AT_LINE (81)) ;
      }else{
        //-------- @ifInstructionForGeneration
        if (GALGAS_bool (kIsEqual, var_rs.reader_uint (SOURCE_FILE_AT_LINE (82)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).isValidAndTrue ()) {
          //-------- @errorInstructionForGeneration
          GALGAS_location location_2 (var_rs.reader_location (HERE)) ; // Implicit use of 'location' reader
          inCompiler->emitSemanticError (location_2, GALGAS_string ("ROM size should be > 0") COMMA_SOURCE_FILE_AT_LINE (83)) ;
        }else{
          //-------- @ifInstructionForGeneration
          if (GALGAS_bool (kIsNotEqual, var_rs.reader_uint (SOURCE_FILE_AT_LINE (84)).modulo_operation (GALGAS_uint ((PMUInt32) 8U), inCompiler COMMA_SOURCE_FILE_AT_LINE (84)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).isValidAndTrue ()) {
            //-------- @errorInstructionForGeneration
            GALGAS_location location_3 (var_rs.reader_location (HERE)) ; // Implicit use of 'location' reader
            inCompiler->emitSemanticError (location_3, GALGAS_string ("ROM size should be a multiple of 8") COMMA_SOURCE_FILE_AT_LINE (85)) ;
          }else{
            //-------- @assignmentInstructionForGeneration
            outArgument_outReservedRomSize = var_rs ;
          }
        }
      }
    } break ;
    case 4: {
      //-------- @terminalCheckInstructionForGeneration
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_ram) COMMA_SOURCE_FILE_AT_LINE (90)) ;
      //-------- @terminalCheckInstructionForGeneration
      GALGAS_lstring var_bankName = inCompiler->synthetizedAttribute_tokenString () ;
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_identifier) COMMA_SOURCE_FILE_AT_LINE (91)) ;
      //-------- @terminalCheckInstructionForGeneration
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken__3D_) COMMA_SOURCE_FILE_AT_LINE (92)) ;
      //-------- @terminalCheckInstructionForGeneration
      GALGAS_luint var_rs = inCompiler->synthetizedAttribute_uint_33__32_value () ;
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_integer) COMMA_SOURCE_FILE_AT_LINE (93)) ;
      //-------- @ifInstructionForGeneration
      if (outArgument_outBootloaderReservedRAMmap.reader_hasKey (var_bankName.reader_string (SOURCE_FILE_AT_LINE (94)) COMMA_SOURCE_FILE_AT_LINE (94)).isValidAndTrue ()) {
        //-------- @errorInstructionForGeneration
        GALGAS_location location_4 (var_rs.reader_location (HERE)) ; // Implicit use of 'location' reader
        inCompiler->emitSemanticError (location_4, GALGAS_string ("RAM size already defined for '").operator_concat (var_bankName.reader_string (SOURCE_FILE_AT_LINE (95)) COMMA_SOURCE_FILE_AT_LINE (95)).operator_concat (GALGAS_string ("' bank") COMMA_SOURCE_FILE_AT_LINE (95)) COMMA_SOURCE_FILE_AT_LINE (95)) ;
      }else{
        //-------- @ifInstructionForGeneration
        if (GALGAS_bool (kIsEqual, var_rs.reader_uint (SOURCE_FILE_AT_LINE (96)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).isValidAndTrue ()) {
          //-------- @errorInstructionForGeneration
          GALGAS_location location_5 (var_rs.reader_location (HERE)) ; // Implicit use of 'location' reader
          inCompiler->emitSemanticError (location_5, GALGAS_string ("RAM size should be > 0") COMMA_SOURCE_FILE_AT_LINE (97)) ;
        }else{
          { //-------- @modifierCallInstructionForGeneration
          outArgument_outBootloaderReservedRAMmap.modifier_insertKey (var_bankName, var_rs, inCompiler COMMA_SOURCE_FILE_AT_LINE (99)) ;
          } //-------- END @typeMethodInstructionForGeneration
        }
      }
    } break ;
    default:
      repeatFlag_0 = false ;
      break ;
    }
  }
  //-------- @terminalCheckInstructionForGeneration
  inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken__7D_) COMMA_SOURCE_FILE_AT_LINE (102)) ;
  //-------- @terminalCheckInstructionForGeneration
  inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken__7B_) COMMA_SOURCE_FILE_AT_LINE (104)) ;
  //-------- @assignmentInstructionForGeneration
  outArgument_outUserRoutineDeclarationList = GALGAS_routineDeclarationList::constructor_emptyList (SOURCE_FILE_AT_LINE (105)) ;
  //-------- @repeatInstructionForGeneration
  bool repeatFlag_6 = true ;
  while (repeatFlag_6) {
    switch (select_pic_31__38__5F_bootloader_5F_syntax_1 (inCompiler)) {
    case 2: {
      //-------- @nonterminalInstructionForGeneration
      nt_routine_5F_declaration_ (outArgument_outUserRoutineDeclarationList, inCompiler) ;
    } break ;
    default:
      repeatFlag_6 = false ;
      break ;
    }
  }
  //-------- @terminalCheckInstructionForGeneration
  inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken__7D_) COMMA_SOURCE_FILE_AT_LINE (110)) ;
  //-------- @assignmentInstructionForGeneration
  outArgument_outSharedRamDefinitionList = GALGAS_ramDefinitionList::constructor_emptyList (SOURCE_FILE_AT_LINE (112)) ;
  //-------- @terminalCheckInstructionForGeneration
  inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken__7B_) COMMA_SOURCE_FILE_AT_LINE (113)) ;
  //-------- @repeatInstructionForGeneration
  bool repeatFlag_7 = true ;
  while (repeatFlag_7) {
    switch (select_pic_31__38__5F_bootloader_5F_syntax_2 (inCompiler)) {
    case 2: {
      //-------- @nonterminalInstructionForGeneration
      nt_ram_5F_definition_ (outArgument_outSharedRamDefinitionList, inCompiler) ;
    } break ;
    default:
      repeatFlag_7 = false ;
      break ;
    }
  }
  //-------- @terminalCheckInstructionForGeneration
  inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken__7D_) COMMA_SOURCE_FILE_AT_LINE (118)) ;
  { //-------- @routineCallInstructionForGeneration
  routine_pic_31__38_BootloaderSpecificationAnalysis (GALGAS_string::constructor_stringWithSourceFilePath (inCompiler COMMA_SOURCE_FILE_AT_LINE (121)), outArgument_outBootloaderName, outArgument_outDeviceName, outArgument_outBootloaderRoutineDeclarationList, outArgument_outBootloaderReservedRAMmap, outArgument_outReservedRomSize, outArgument_outUserRoutineDeclarationList, outArgument_outSharedRamDefinitionList, outArgument_outListFileContents, outArgument_outPiccoloDeviceModel, outArgument_outAccessBankSplitOffset, outArgument_outRamBank, outArgument_outRegisterTable, inCompiler COMMA_SOURCE_FILE_AT_LINE (120)) ;
  } //-------- @routineCallInstructionForGeneration
}

void cParser_pic_31__38__5F_bootloader_5F_syntax::rule_pic_31__38__5F_bootloader_5F_syntax_start_5F_symbol_i1_ (C_Lexique_piccolo_5F_lexique * inCompiler) {
  //-------- @localVariableDeclarationForGeneration
  GALGAS_lstring var_bootloaderName ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_lstring var_deviceName ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_routineDeclarationList var_bootloaderRoutineDeclarationList ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_bootloaderReservedRAMmap var_bootloaderReservedRAMmap ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_luint var_reservedRomSize ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_routineDeclarationList var_userRoutineDeclarationList ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_ramDefinitionList var_sharedRamDefinitionList ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_string var_listFileContents ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_piccoloDeviceModel var_piccoloDeviceModel ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_uint var_accessBankSplitOffset ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_ramBankTable var_ramBank ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_registerTable var_registerTable ;
  //-------- @nonterminalInstructionForGeneration
  nt_parse_5F_bootloader_ (var_bootloaderName, var_deviceName, var_bootloaderRoutineDeclarationList, var_bootloaderReservedRAMmap, var_reservedRomSize, var_userRoutineDeclarationList, var_sharedRamDefinitionList, var_listFileContents, var_piccoloDeviceModel, var_accessBankSplitOffset, var_ramBank, var_registerTable, inCompiler) ;
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_string var_listingFile = GALGAS_string::constructor_stringWithSourceFilePath (inCompiler COMMA_SOURCE_FILE_AT_LINE (167)).reader_stringByDeletingPathExtension (SOURCE_FILE_AT_LINE (167)).operator_concat (GALGAS_string (".list") COMMA_SOURCE_FILE_AT_LINE (167)) ;
  //-------- @ifInstructionForGeneration
  if (GALGAS_bool (kIsEqual, GALGAS_uint::constructor_errorCount (inCompiler COMMA_SOURCE_FILE_AT_LINE (168)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).operator_and (GALGAS_bool (gOption_piccolo_5F_options_ouputListingFile.reader_value ()) COMMA_SOURCE_FILE_AT_LINE (168)).isValidAndTrue ()) {
    //-------- @methodCallInstructionForGeneration
    GALGAS_bool joker_5411_0 ; // Joker input parameter
    var_listFileContents.method_writeToFileWhenDifferentContents (var_listingFile, joker_5411_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (169)) ;
    //-------- END @methodCallInstructionForGeneration
  }
  //-------- @ifInstructionForGeneration
  if (GALGAS_bool (kIsStrictSup, GALGAS_uint::constructor_errorCount (inCompiler COMMA_SOURCE_FILE_AT_LINE (171)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).isValidAndTrue ()) {
    { //-------- @typeMethodInstructionForGeneration
    GALGAS_string::class_method_deleteFileIfExists (var_listingFile, inCompiler COMMA_SOURCE_FILE_AT_LINE (172)) ;
    } //-------- @routineCallInstructionForGeneration
  }
}

