pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_bootloader_syntax.cpp
void cParser_pic_31__38__5F_bootloader_5F_syntax::rule_pic_31__38__5F_bootloader_5F_syntax_start_5F_symbol_i1_importBootloaderSpecification (GALGAS_piccoloDeviceModel & outArgument_outPiccoloDeviceModel,
                                                                                                                                             GALGAS_uint & outArgument_outAccessBankSplitOffset,
                                                                                                                                             GALGAS_ramBankTable & outArgument_outRamBank,
                                                                                                                                             GALGAS_registerTable & outArgument_outRegisterTable,
                                                                                                                                             GALGAS_bootloaderReservedRAMmap & outArgument_outBootloaderReservedRAMmap,
                                                                                                                                             GALGAS_routineDeclarationList & outArgument_outBootloaderRoutineDeclarationList,
                                                                                                                                             GALGAS_routineDeclarationList & outArgument_outUserRoutineDeclarationList,
                                                                                                                                             GALGAS_luint & outArgument_outBootloaderReservedROMsize,
                                                                                                                                             C_Lexique_piccolo_5F_lexique * inCompiler) {
  outArgument_outPiccoloDeviceModel.drop () ; // Release 'out' argument
  outArgument_outAccessBankSplitOffset.drop () ; // Release 'out' argument
  outArgument_outRamBank.drop () ; // Release 'out' argument
  outArgument_outRegisterTable.drop () ; // Release 'out' argument
  outArgument_outBootloaderReservedRAMmap.drop () ; // Release 'out' argument
  outArgument_outBootloaderRoutineDeclarationList.drop () ; // Release 'out' argument
  outArgument_outUserRoutineDeclarationList.drop () ; // Release 'out' argument
  outArgument_outBootloaderReservedROMsize.drop () ; // Release 'out' argument
  //-------- @localVariableDeclarationForGeneration
  GALGAS_lstring var_bootloaderName ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_lstring var_deviceName ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_ramDefinitionList var_sharedRamDefinitionList ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_string var_listFileContents ;
  //-------- @nonterminalInstructionForGeneration
  nt_parse_5F_bootloader_ (var_bootloaderName, var_deviceName, outArgument_outBootloaderRoutineDeclarationList, outArgument_outBootloaderReservedRAMmap, outArgument_outBootloaderReservedROMsize, outArgument_outUserRoutineDeclarationList, var_sharedRamDefinitionList, var_listFileContents, outArgument_outPiccoloDeviceModel, outArgument_outAccessBankSplitOffset, outArgument_outRamBank, outArgument_outRegisterTable, inCompiler) ;
}

void cParser_pic_31__38__5F_bootloader_5F_syntax::rule_pic_31__38__5F_bootloader_5F_syntax_routine_5F_declaration_i2_ (GALGAS_routineDeclarationList & ioArgument_ioRoutineDefinitionList,
                                                                                                                       C_Lexique_piccolo_5F_lexique * inCompiler) {
  //-------- @localVariableDeclarationForGeneration
  GALGAS_bool var_noreturn ;
  //-------- @selectInstructionForGeneration
  switch (select_pic_31__38__5F_bootloader_5F_syntax_3 (inCompiler)) {
  case 1: {
    //-------- @assignmentInstructionForGeneration
    var_noreturn = GALGAS_bool (false) ;
  } break ;
  case 2: {
    //-------- @terminalCheckInstructionForGeneration
    inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_noreturn) COMMA_SOURCE_FILE_AT_LINE (213)) ;
    //-------- @assignmentInstructionForGeneration
    var_noreturn = GALGAS_bool (true) ;
  } break ;
  default:
    break ;
  }
  //-------- @terminalCheckInstructionForGeneration
  inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_routine) COMMA_SOURCE_FILE_AT_LINE (216)) ;
  //-------- @terminalCheckInstructionForGeneration
  GALGAS_lstring var_routineName = inCompiler->synthetizedAttribute_tokenString () ;
  inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_identifier) COMMA_SOURCE_FILE_AT_LINE (217)) ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_luint var_requiredBank ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_luint var_returnedBank ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_bool var_preservesBank ;
  //-------- @selectInstructionForGeneration
  switch (select_pic_31__38__5F_bootloader_5F_syntax_4 (inCompiler)) {
  case 1: {
    //-------- @assignmentInstructionForGeneration
    var_requiredBank = GALGAS_luint::constructor_new (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (222)), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (222)) ;
    //-------- @assignmentInstructionForGeneration
    var_returnedBank = GALGAS_luint::constructor_new (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (223)), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (223)) ;
    //-------- @assignmentInstructionForGeneration
    var_preservesBank = GALGAS_bool (false) ;
  } break ;
  case 2: {
    //-------- @terminalCheckInstructionForGeneration
    inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_bank) COMMA_SOURCE_FILE_AT_LINE (226)) ;
    //-------- @terminalCheckInstructionForGeneration
    inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken__3A_) COMMA_SOURCE_FILE_AT_LINE (227)) ;
    //-------- @selectInstructionForGeneration
    switch (select_pic_31__38__5F_bootloader_5F_syntax_5 (inCompiler)) {
    case 1: {
      //-------- @terminalCheckInstructionForGeneration
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_preserved) COMMA_SOURCE_FILE_AT_LINE (229)) ;
      //-------- @ifInstructionForGeneration
      if (var_noreturn.isValidAndTrue ()) {
        //-------- @errorInstructionForGeneration
        inCompiler->emitSemanticError (inCompiler->here (), GALGAS_string ("a \"noreturn\" routine cannot accept \"bank:preserved\" setting") COMMA_SOURCE_FILE_AT_LINE (231)) ;
      }
      //-------- @assignmentInstructionForGeneration
      var_preservesBank = GALGAS_bool (true) ;
      //-------- @assignmentInstructionForGeneration
      var_requiredBank = GALGAS_luint::constructor_new (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (234)), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (234)) ;
      //-------- @assignmentInstructionForGeneration
      var_returnedBank = GALGAS_luint::constructor_new (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (235)), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (235)) ;
    } break ;
    case 2: {
      //-------- @terminalCheckInstructionForGeneration
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_requires) COMMA_SOURCE_FILE_AT_LINE (237)) ;
      //-------- @terminalCheckInstructionForGeneration
      var_requiredBank = inCompiler->synthetizedAttribute_uint_33__32_value () ;
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_integer) COMMA_SOURCE_FILE_AT_LINE (238)) ;
      //-------- @assignmentInstructionForGeneration
      var_preservesBank = GALGAS_bool (false) ;
      //-------- @selectInstructionForGeneration
      switch (select_pic_31__38__5F_bootloader_5F_syntax_6 (inCompiler)) {
      case 1: {
        //-------- @assignmentInstructionForGeneration
        var_returnedBank = GALGAS_luint::constructor_new (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (241)), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (241)) ;
      } break ;
      case 2: {
        //-------- @terminalCheckInstructionForGeneration
        inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_ensures) COMMA_SOURCE_FILE_AT_LINE (243)) ;
        //-------- @terminalCheckInstructionForGeneration
        var_returnedBank = inCompiler->synthetizedAttribute_uint_33__32_value () ;
        inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_integer) COMMA_SOURCE_FILE_AT_LINE (244)) ;
        //-------- @ifInstructionForGeneration
        if (var_noreturn.isValidAndTrue ()) {
          //-------- @errorInstructionForGeneration
          inCompiler->emitSemanticError (inCompiler->here (), GALGAS_string ("a \"noreturn\" routine cannot accept \"bank:returned\" setting") COMMA_SOURCE_FILE_AT_LINE (246)) ;
        }
      } break ;
      default:
        break ;
      }
    } break ;
    case 3: {
      //-------- @terminalCheckInstructionForGeneration
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_ensures) COMMA_SOURCE_FILE_AT_LINE (250)) ;
      //-------- @terminalCheckInstructionForGeneration
      var_returnedBank = inCompiler->synthetizedAttribute_uint_33__32_value () ;
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_integer) COMMA_SOURCE_FILE_AT_LINE (251)) ;
      //-------- @ifInstructionForGeneration
      if (var_noreturn.isValidAndTrue ()) {
        //-------- @errorInstructionForGeneration
        inCompiler->emitSemanticError (inCompiler->here (), GALGAS_string ("a \"noreturn\" routine cannot accept \"bank:returned\" setting") COMMA_SOURCE_FILE_AT_LINE (253)) ;
      }
      //-------- @assignmentInstructionForGeneration
      var_preservesBank = GALGAS_bool (false) ;
      //-------- @assignmentInstructionForGeneration
      var_requiredBank = GALGAS_luint::constructor_new (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (256)), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (256)) ;
    } break ;
    default:
      break ;
    }
  } break ;
  default:
    break ;
  }
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioRoutineDefinitionList.addAssign_operation (var_routineName, var_requiredBank, var_returnedBank, var_preservesBank, var_noreturn COMMA_SOURCE_FILE_AT_LINE (260)) ;
}

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2


